Revit 2027 API
FabricArea.Create Method
Overload List
Name | Description
Create(Document, Element, XYZ, ElementId, ElementId) |  Creates a FabricArea based on a host boundary.
Create(Document, Element, IList<CurveLoop>, XYZ, XYZ, ElementId, ElementId) |  Creates a FabricArea from an array of curves.
Top
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace